---
kind: property
id: P:Autodesk.Revit.DB.ElementDesignOptionFilter.DesignOptionId
source: html/9730dc27-f547-6a93-a5d6-7c5d65e9b8c9.htm
---
# Autodesk.Revit.DB.ElementDesignOptionFilter.DesignOptionId Property

The design option id.

## Syntax (C#)
```csharp
public ElementId DesignOptionId { get; }
```